app/controllers/orders_controller.rb

    def get_week_disbursements

        _params = params.permit(:merchant_id, :week_date)

        _start_of_week = Time.at(params[:week_date].to_i).utc.beginning_of_week
        _end_of_week = Time.at(params[:week_date].to_i).utc.end_of_week

        _ret_disbursements = WeeklyDisbursement.where(week_start_date: _start_of_week.to_i, week_end_date: _end_of_week)
        _ret_disbursements = _ret_disbursements.where(merchant_id: _params[:merchant_id]) if _params[:merchant_id].present?
---
SELECT "weekly_disbursements".* FROM "weekly_disbursements" WHERE "weekly_disbursements"."week_start_date" = $1 AND "weekly_disbursements"."week_end_date" = $2 AND "weekly_disbursements"."merchant_id" = $3  [["week_start_date", 1514764800], ["week_end_date", 1515369599], ["merchant_id", 1]]