app/jobs/process_disbursements_job.rb

SELECT "disbursement_rules".* FROM "disbursement_rules"
SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1  [["id", 1]]
SELECT "weekly_disbursements".* FROM "weekly_disbursements" WHERE "weekly_disbursements"."week_start_date" = $1 AND "weekly_disbursements"."week_end_date" = $2 AND "weekly_disbursements"."merchant_id" = $3  [["week_start_date", 1514764800], ["week_end_date", 1515369599], ["merchant_id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."merchant_id" = $1 AND (completed_at >= '2018-01-01 00:00:00' AND completed_at <= '2018-01-07 23:59:59.999999')  [["merchant_id", 1]]
---
    def perform(params)

        if params[:week_date].blank?
            build_response({}, false, 500, 'A date for the week needs to be specified', 500) and return
        end

        _start_of_week = Time.at(params[:week_date].to_i).utc.beginning_of_week
        _end_of_week = Time.at(params[:week_date].to_i).utc.end_of_week

        if _end_of_week.to_i > Time.now.utc.to_i
            build_response({}, false, 500, 'Cannot process uncompleted weeks', 500) and return
        end

        _merchants = nil
        if params[:merchant_id].present?
            _merchants = Merchant.where(id: params[:merchant_id].to_i)
        else
            _merchants = Merchant.all
        end

        _disbursement_rules = DisbursementRule.all.map{|r| {
            id: r.id,
            start_value: r.start_value,
            end_value: r.end_value,
            fee_percentage: r.fee_percentage
        }}

        _merchants.each do |merchant|

            _disbursement = WeeklyDisbursement.where(week_start_date: _start_of_week.to_i, week_end_date: _end_of_week, merchant_id: merchant.id)

            next if _disbursement.present?

            _orders = merchant.orders.where('completed_at >= ? AND completed_at <= ?', _start_of_week, _end_of_week)

INSERT INTO "weekly_disbursements" ("week_start_date", "week_end_date", "merchant_id", "disbursement_value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
            end

            _disbursement = WeeklyDisbursement.new(week_start_date: _start_of_week.to_i, week_end_date: _end_of_week, merchant_id: merchant.id, disbursement_value: _disbursement_value.to_f)
            _disbursement.save